In [2]:
#1. Импортируйте библиотеку Numpy и дайте ей псевдоним np.
import numpy as np

In [34]:
#Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов.

#Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй — числа 6, 8, 11, 10, 7.
a = np.array([[1, 6],
             [2, 8],
             [3, 11],
             [3, 10],
             [1, 7]])

In [52]:
mean_a = a.mean(axis = 0)
print(mean_a)

[2.  8.4]

In [54]:
#2 Вычислите массив a_centered, отняв от значений массива а

#средние значения соответствующих признаков, содержащиеся в массиве mean_a.
a_centered = a - mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

In [56]:
#3. Найдите скалярное произведение столбцов массива a_centered.

#В результате должна получиться величина a_centered_sp.

a1=a_centered[:,0]

a2=a_centered[:,1]

a_centered_sp=np.dot(a1,a2)

a_centered_sp

8.0

In [57]:
N=a.shape[0]

N

5

In [65]:
my_cov=a_centered_sp/(N-1)

my_cov

2.0

In [66]:
#1. Импортируйте библиотеку Pandas и дайте ей псевдоним pd.

import pandas as pd

In [73]:
#Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные:

#[1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].

authors = pd.DataFrame({'author_id':[1, 2, 3],

'author_name':['Тургенев', 'Чехов', 'Островский']}, columns=['author_id', 'author_name'])

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [84]:
#создайте датафрейм book cо столбцами author_id, book_title и price,

#в которых соответственно содержатся данные: [1, 1, 1, 2, 2, 3, 3],

#['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],

#[450, 300, 350, 500, 450, 370, 290].

books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],

'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],

'price':[450, 300, 350, 500, 450, 370, 290]},

columns=['author_id', 'book_title', 'price'])

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [88]:
#2. Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

authors_price = pd.merge(authors, books, on = 'author_id', how = 'outer')

authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [92]:
#3. Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

top5=authors_price.nlargest(5, 'price')

top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [97]:
#4. Создайте датафрейм authors_stat на основе информации из authors_price.

#В датафрейме authors_stat должны быть четыре столбца:

#author_name, min_price, max_price и mean_price,

#в которых должны содержаться соответственно имя автора,

#минимальная, максимальная и средняя цена на книги этого автора.

df1 = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price':'min_price'})

df2 = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price':'max_price'})

df3 = authors_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price':'mean_price'})

authors_stat=pd.concat([df1, df2, df3], axis = 1)

authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000